; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image2 - mode
	image7 - mode
	spectrograph5 - mode
	infrared9 - mode
	image4 - mode
	infrared3 - mode
	image10 - mode
	spectrograph1 - mode
	infrared0 - mode
	infrared6 - mode
	thermograph8 - mode
	Star0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 image7)
	(supports instrument0 thermograph8)
	(supports instrument0 infrared6)
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph1)
	(supports instrument0 image10)
	(supports instrument0 infrared3)
	(supports instrument0 image4)
	(supports instrument0 infrared9)
	(supports instrument0 spectrograph5)
	(supports instrument0 image2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
)
(:goal (and
	(have_image Phenomenon5 infrared3)
	(have_image Star6 thermograph8)
	(have_image Star6 infrared0)
	(have_image Star6 infrared9)
	(have_image Star7 image7)
	(have_image Star7 infrared9)
	(have_image Phenomenon8 image10)
	(have_image Phenomenon8 spectrograph5)
	(have_image Phenomenon8 infrared6)
	(have_image Phenomenon9 thermograph8)
	(have_image Phenomenon9 image10)
	(have_image Phenomenon9 image4)
	(have_image Phenomenon10 image10)
	(have_image Phenomenon10 image7)
	(have_image Phenomenon10 infrared6)
))

)

; plan
1. (turn_to satellite0 star4 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star4)
   goals met: 0 of 15
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 15
3. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 0 of 15
4. (turn_to satellite0 phenomenon8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon8)
   goals met: 0 of 15
5. (take_image satellite0 phenomenon8 instrument0 spectrograph5)
   added: (have_image phenomenon8 spectrograph5)
   goals met: 1 of 15
6. (take_image satellite0 phenomenon8 instrument0 infrared6)
   added: (have_image phenomenon8 infrared6)
   goals met: 2 of 15
7. (take_image satellite0 phenomenon8 instrument0 image10)
   added: (have_image phenomenon8 image10)
   goals met: 3 of 15
8. (turn_to satellite0 phenomenon5 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 15
9. (take_image satellite0 phenomenon5 instrument0 infrared3)
   added: (have_image phenomenon5 infrared3)
   goals met: 4 of 15
10. (turn_to satellite0 phenomenon10 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 15
11. (take_image satellite0 phenomenon10 instrument0 infrared6)
   added: (have_image phenomenon10 infrared6)
   goals met: 5 of 15
12. (take_image satellite0 phenomenon10 instrument0 image7)
   added: (have_image phenomenon10 image7)
   goals met: 6 of 15
13. (take_image satellite0 phenomenon10 instrument0 image10)
   added: (have_image phenomenon10 image10)
   goals met: 7 of 15
14. (turn_to satellite0 phenomenon9 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon9)
   goals met: 7 of 15
15. (take_image satellite0 phenomenon9 instrument0 image10)
   added: (have_image phenomenon9 image10)
   goals met: 8 of 15
16. (take_image satellite0 phenomenon9 instrument0 image4)
   added: (have_image phenomenon9 image4)
   goals met: 9 of 15
17. (take_image satellite0 phenomenon9 instrument0 thermograph8)
   added: (have_image phenomenon9 thermograph8)
   goals met: 10 of 15
18. (turn_to satellite0 star6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star6)
   goals met: 10 of 15
19. (take_image satellite0 star6 instrument0 infrared0)
   added: (have_image star6 infrared0)
   goals met: 11 of 15
20. (take_image satellite0 star6 instrument0 infrared9)
   added: (have_image star6 infrared9)
   goals met: 12 of 15
21. (take_image satellite0 star6 instrument0 thermograph8)
   added: (have_image star6 thermograph8)
   goals met: 13 of 15
22. (turn_to satellite0 star7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star7)
   goals met: 13 of 15
23. (take_image satellite0 star7 instrument0 image7)
   added: (have_image star7 image7)
   goals met: 14 of 15
24. (take_image satellite0 star7 instrument0 infrared9)
   added: (have_image star7 infrared9)
   goals met: 15 of 15
